app/views/tags/show.html.erb

SELECT "articles".* FROM "articles" INNER JOIN "taggings" ON "articles"."id" = "taggings"."article_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 10]]
---
<h1>Articles tagged: <i><%= @tag.name %></i></h1>
<% @tag.articles.each do |article| %>