app/controllers/articles_controller.rb

	def destroy
		@article = Article.find(params[:id])

		flash.notice = "Article: \"#{@article.title}\" has been deleted"

		@article.destroy
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 5]]