app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "crypted_password", "email", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

UPDATE "authors" SET "crypted_password" = ?, "salt" = ?, "updated_at" = ? WHERE "authors"."id" = 3  [["crypted_password", "$2a$10$cpDQI4m6efH0slCsRG941ebLIF.MWPbfUUyh/2Kkfdz07aEHlWWEq"], ["salt", "xU4KpoSxM7sxSEcku6vz"], ["updated_at", "2014-09-14 00:32:09.049747"]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)