app/controllers/tags_controller.rb

	def index
		remove_empty_tags
		@tags = Tag.all
---
SELECT "tags".* FROM "tags"